makeespresso/app/controllers/products_controller.rb

  def create
    @product = @current_user.products.new(product_params)
    if @product.save
---
INSERT INTO "products" ("image", "geography", "toast", "aroma", "body", "acidity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["image", "q"], ["geography", "e"], ["toast", "t"], ["aroma", "y"], ["body", "u"], ["acidity", "i"], ["created_at", "2019-08-13 20:58:02.640434"], ["updated_at", "2019-08-13 20:58:02.640434"]]

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "image" = $1, "geography" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["image", "nueva"], ["geography", "neuva"], ["updated_at", "2019-08-14 16:58:59.075874"], ["id", 2]]

  def set_Product
    @product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]